//*************************************************************************
//			初始化IO口子程序
//*************************************************************************
void Port12864_init()
{

	P4SEL = 0x00;
        P4DIR = 0xFF;
        P5SEL = 0x00;
        P5DIR|= BIT0 + BIT1 + BIT5 + BIT6 + BIT7;
        PSB_SET;		  //液晶并口方式
	RST_SET;		  //复位脚RST置高
}

//***********************************************************************
//	显示屏命令写入函数
//***********************************************************************
void LCD_write_com(unsigned char com) 
{	
	RS_CLR;
	RW_CLR;
	EN_SET;
	DataPort = com;
	delay_ms(5);
	EN_CLR;
}

//***********************************************************************
//	显示屏数据写入函数
//***********************************************************************
void LCD_write_data(unsigned char data) 
{
	RS_SET;
	RW_CLR;
	EN_SET;
	DataPort = data;
	delay_ms(5);
	EN_CLR;
}

//***********************************************************************
//	显示屏清空显示
//***********************************************************************
void LCD_clear(void) 
{
	LCD_write_com(0x01);
	delay_ms(5);
}

//***********************************************************************
//函数名称：DisplayCgrom(uchar hz)显示CGROM里的汉字
//***********************************************************************
void DisplayCgrom(uchar addr,uchar *hz)
{
	LCD_write_com(addr);
        delay_ms(5);
	while(*hz != '\0')
	{
		LCD_write_data(*hz);
		hz++;
                delay_ms(5);
	}

} 

//****************************************************************
//函数名称：Display()显示测试结果
//****************************************************************
void Display(void)
{
	DisplayCgrom(0x80,"欣世纪电子欢迎你");
	DisplayCgrom(0x88,"旺:jingyehanxing");
	DisplayCgrom(0x90,"www.avrgcc.com  ");
	DisplayCgrom(0x98,"电话057487470625");

}

//***********************************************************************
//	显示屏初始化函数
//***********************************************************************
void LCD_init(void) 
{
	LCD_write_com(FUN_MODE);			//显示模式设置
	delay_ms(5);
	LCD_write_com(FUN_MODE);			//显示模式设置
	delay_ms(5);
        LCD_write_com(DISPLAY_ON);			//显示开
	delay_ms(5);
        LCD_write_com(CLEAR_SCREEN);			//清屏
	delay_ms(5);
}

//***********************************************************************
//      12864液晶显示函数，仅显示一次
//***********************************************************************
void Test_LCD12864(void)
{
        uchar j;

        Port12864_init();                             //系统初始化，设置IO口属性
	delay_ms(20);                                 //延时20ms
	LCD_init();                                   //液晶参数初始化设置
	LCD_clear();                                  //清屏
	for(j=0;j<1;j++)
	{
	Display();                                    //显示汉字
	}
}