//***********************************************************************
//               MSP430配置头文件
//***********************************************************************
#include <msp430x14x.h>


//**********************************************************************
//                  有TFT彩屏时系统板测试功能函数
//**********************************************************************
void TestMode_LCDFunction()
{
  delay_ms(200);
  while(1)
    {  
      while(Key_Scan()==0xff);               //等待按键按下选择测试模式
      if(key!=0xff)                          //如果有按键按下，则显示该按键键值1～4
        {
	  {
            switch(key)
              {
	        case 1: Test_TFT_Show_Touch();break;  //给不同的键赋键值，键值1，亮2个LED灯
                case 2: Test_TFT_Show_H();break;      //给不同的键赋键值，键值2，亮2个LED灯
                case 3: Test_TFT_SD();break;	      //给不同的键赋键值，键值3，亮2个LED灯
                case 4: Test_TFT_18B20();break;	      //给不同的键赋键值，键值4，亮2个LED灯
              }

          }
	
       }
     else
      {
        //LED=key;              	//没有按键的时候显示上次的键值
      }
    }
  
}