/********************************************************************
//DM430-L型最小系统板4位独立按键作为中断按键使用测试程序，下降沿触发
//按不同的按键，显示不同的LED灯，具体请看程序，测试外部中断功能
//调试环境：EW430 V5.30
//作者：www.avrgcc.com
//时间：2014.03.01
********************************************************************/

#include <msp430x14x.h>
#include "Config.h"

uchar key;

//*************************************************************************
//	初始化IO口子程序
//*************************************************************************
void Port_init()
{

  P1SEL = 0x00;                   //P1普通IO功能
  P1DIR = 0xF0;                   //P10~P13输入模式，外部电路已接上拉电阻
  P1IE  = 0x0F;                   //开启P1低四位中断
  P1IES = 0x0F;                   //下降沿触发中断
  P1IFG = 0x00;                   //软件清零中断标志寄存器
  
  LED8DIR = 0xFF;                 //P6口输出模式
  LED8  = 0xFF;                   //先关闭所有LED
}

//**********************************************************************
//	P1口中断服务程序，需要判断
//**********************************************************************
#pragma vector = PORT1_VECTOR
__interrupt void P1_IRQ(void)
{
  switch(P1IFG&0x0F)
  {
  case 0x01: key=0x01;LED8 = 0xFC;P1IFG=0x00;break;     // 引脚0对应S1中断，必须手动清标志位，点亮D1D2
  case 0x02: key=0x02;LED8 = 0xF3;P1IFG=0x00;break;     // 引脚1对应S2中断，必须手动清标志位，点亮D3D4
  case 0x04: key=0x03;LED8 = 0xCF;P1IFG=0x00;break;     // 引脚2对应S3中断，必须手动清标志位，点亮D5D6
  case 0x08: key=0x04;LED8 = 0x3F;P1IFG=0x00;break;     // 引脚3对应S4中断，必须手动清标志位，点亮D7D8
  }
}

//*************************************************************************
//		主程序
//*************************************************************************

void main(void)
{     
  WDT_Init();                            //看门狗设置
  Clock_Init();                          //系统时钟设置
  Port_init();                           //系统初始化，设置IO口属性
  delay_ms(100);                         //延时100ms
  _EINT();                               //使能中断
  while(1);
}

