/********************************************************************
//DM430-L内部温度传感器测试程序,MSP430芯片自带的传感器
//用MSP430F149内部的温度传感器,通过ADC12的通道10进行AD转换
//温度没有精确到0.1度，只提取了个位和十位，显示到1602液晶
//计算取得摄氏温度和华氏温度,如果没有1602液晶，可通过仿真器断点在View->Watch中观察温度值
//由于定标问题, 可能会存在温度的误差  
//调试环境：EW430 V5.30
//作者：www.avrgcc.com
//时间：2014.03.01
********************************************************************/

#include <msp430x14x.h>
#include "Config.h"

ulong temp;
ulong TemperF;                             //华氏温度
ulong TemperC;                             //摄氏温度

//*************************************************************************
//			初始化IO口子程序
//*************************************************************************
void Port_init()
{

	P4SEL = 0x00;
        P4DIR = 0xFF;                   //数据口输出模式
        P5SEL = 0x00;
        P5DIR|= BIT5 + BIT6 + BIT7;     //控制口设置为输出模式
}

//***********************************************************************
//	显示屏命令写入函数
//***********************************************************************
void LCD_write_com(unsigned char com) 
{	
	RS_CLR;
	RW_CLR;
	EN_SET;
	DataPort = com;                 //命令写入端口
	delay_ms(5);
	EN_CLR;
}

//***********************************************************************
//	显示屏数据写入函数
//***********************************************************************
void LCD_write_data(unsigned char data) 
{
	RS_SET;
	RW_CLR;
	EN_SET;
	DataPort = data;                //数据写入端口
	delay_ms(5);
	EN_CLR;
}

//***********************************************************************
//	显示屏清空显示
//***********************************************************************
void LCD_clear(void) 
{
	LCD_write_com(0x01);            //清屏幕显示
	delay_ms(5);
}

//***********************************************************************
//	显示屏字符串写入函数
//***********************************************************************
void LCD_write_str(unsigned char x,unsigned char y,unsigned char *s) 
{
	
    if (y == 0) 
    {
    	LCD_write_com(0x80 + x);        //第一行显示
    }
    else 
    {
    	LCD_write_com(0xC0 + x);        //第二行显示
    }
    
    while (*s) 
    {
    	LCD_write_data( *s);
    	s ++;
    }
}

//***********************************************************************
//	显示屏单字符写入函数
//***********************************************************************
void LCD_write_char(unsigned char x,unsigned char y,unsigned char data) 
{
	
    if (y == 0) 
    {
    	LCD_write_com(0x80 + x);        //第一行显示
    }
    else 
    {
    	LCD_write_com(0xC0 + x);        //第二行显示
    }
    
    LCD_write_data( data);  
}

//***********************************************************************
//	显示屏初始化函数
//***********************************************************************
void LCD_init(void) 
{
    LCD_write_com(0x38);		//显示模式设置  
    delay_ms(5);
    LCD_write_com(0x08);		//显示关闭
    delay_ms(5);
    LCD_write_com(0x01);		//显示清屏
    delay_ms(5);
    LCD_write_com(0x06);		//显示光标移动设置
    delay_ms(5);
    LCD_write_com(0x0C);		//显示开及光标设置
    delay_ms(5);
}

//***********************************************************************
//      中断服务程序
//***********************************************************************
#pragma vector=ADC_VECTOR
__interrupt void ADC12ISR(void) {
    temp = ADC12MEM0;                                          //保存转换结果
}

//***********************************************************************
//      液晶显示界面初始化
//***********************************************************************
void LCD_Desk(void)
{    
  LCD_clear();
  LCD_write_str(0,0,"The Temperature:");
  delay_ms(250);
}

//***********************************************************************
//      液晶显示温度值
//***********************************************************************
void LCD_DisplayTemp(uchar temp)
{    
  LCD_write_char(0x0b,1,0x30+temp/10);
  LCD_write_char(0x0c,1,0x30+temp%10);
  LCD_write_char(0x0d,1,'C');
}

//***********************************************************************
//      主程序
//***********************************************************************
void main(void) 
{
  
    WDT_Init();                         //看门狗设置
    Clock_Init();                       //系统时钟设置
    Port_init();                        //系统初始化，设置IO口属性
    delay_ms(100);                      //延时100ms
    LCD_init();                         //液晶参数初始化设置
    LCD_clear();                        //清屏
    LCD_Desk();
     
    ADC12CTL0 = SHT0_8 + REFON + ADC12ON;  //内部1.5V参考电压,打开ADC12模块,设置采样保持定时器
    ADC12CTL1 = SHP;                                   //采使用采样定时器
    ADC12MCTL0 = SREF_1 + INCH_10;                     //参考电压和通道选择
    ADC12IE = BIT0;                                    //ADC12MEM0
    ADC12CTL0 |= ENC;                                  //允许转换

    _BIS_SR(GIE);                                      //开启系统中断

    while(1) 
    {
        ADC12CTL0 |= ADC12SC;                          //开始采样并AD转换

        //oF = ((x/4096)*1500mV)-923mV)*1/1.97mV = x*761/4096 - 468
        //IntDegF = (ADC12MEM0 - 2519)* 761/4096
        TemperF = (temp - 2519) * 761;
        TemperF = TemperF / 4096;                      //简化的华氏温度转换公式

        //oC = ((x/4096)*1500mV)-986mV)*1/3.55mV = x*423/4096 - 278
        //IntDegC = (ADC12MEM0 - 2692)* 423/4096
        TemperC = (temp - 2692) * 423;
        TemperC = TemperC / 4096;                      //简化的摄氏温度转换公式
        
        LCD_DisplayTemp((uchar)TemperC);
        
        delay_ms(500);

        _NOP();                                        //加入断点可用来观察TemperF和TemperC结果
    }
}

