/********************************************************************
//DM430-L型开发板使用MSP430f169内部DAC模块通过DMA模块的传输产生10kHz的正玄信号
//本程序在一个周期内取点为100个，可以用示波器查看，接在DAC0端口，也就是P66口
//通过示波器查看是完整的波形，大概10K，频率是通过定时器实现
//MSP430F149核心芯片的开发板不支持DAC功能
//调试环境：EW430 V5.30
//作者：www.avrgcc.com
//时间：2014.03.01
********************************************************************/
#include <msp430x16x.h>
#include "Config.h"                     //开发板配置头文件，主要配置IO端口信息

static int Sin_tab[100] = {
1638,
1740,
1843,
1944,
2045,
2143,
2240,
2335,
2426,
2515,
2600,
2681,
2758,
2831,
2899,
2962,
3020,
3072,
3119,
3160,
3195,
3224,
3246,
3262,
3272,
3272,
3263,
3247,
3224,
3196,
3161,
3120,
3074,
3021,
2964,
2901,
2833,
2760,
2683,
2602,
2517,
2429,
2337,
2243,
2146,
2047,
1947,
1845,
1743,
1640,
1537,
1435,
1333,
1233,
1134,
1037,
943,
851,
762,
677,
596,
519,
446,
378,
314,
256,
204,
157,
116,
81,
52,
29,
13,
3,
0,
2,
12,
28,
50,
78,
113,
154,
200,
252,
310,
373,
440,
513,
590,
671,
756,
756,
844,
936,
1030,
1127,
1225,
1326,
1427,
1529,
};

/********************************************************************
			主程序
********************************************************************/
void main(void)
{
  WDT_Init();                               // 关闭看门狗
  Clock_Init();                             //时钟系统初始化，设置为外部时钟
  P5SEL=0XFF;
  ADC12CTL0 = REFON;                        // 参考电压为内部2.5v
  DMA0SA = (int) Sin_tab;                   // 源地址寄存器
  DMA0DA = DAC12_0DAT_;                     // 目的地址寄存器
  DMA0SZ = 100;                             // 传输基本单元的个数
  DMACTL0 = DMA0TSEL_5;                     // DAC12_0CTL的DAC12IFG标志 
  DMA0CTL = DMADT_4 + DMASRCINCR_3 + DMAEN; // DMADT_4：重复的块传输方式 Rpt, inc src, word-word
  DAC12_0CTL = DAC12LSEL_2 + DAC12IR + DAC12AMP_5 + DAC12IFG + DAC12ENC; // Config
                                            // **force first interrupt**
  CCTL1 = OUTMOD_3;                         // Set/reset置位/复位模式，用于设定频率
  CCR1 = 1;                                 // PWM Duty Cycle 
  CCR0 = 8-1;                               // ~1kHz Clock period
  TACTL = TASSEL_2 + MC_1;                  // SMCLK, up-mode

  _BIS_SR(LPM0_bits);                       // Enter LPM0
}