/********************************************************************
//DM430-L型最小系统板控制8个发光二极管流水显示测试程序
//发光二极管分别接入P60~P67,灌电流方式，延时函数使用IAR软件自带函数
//调试环境：EW430 V5.30
//作者：www.avrgcc.com
//时间：2014.03.01
********************************************************************/

#include <msp430x14x.h>
#include "Config.h"

//***********************************************************************
//               MSP430IO口初始化
//***********************************************************************
void Port_Init()
{
  LED8DIR = 0xff;                    //设置IO口方向为输出
  LED8 = 0xFF;                       //初始设置为00
}

/********************************************************************
				LED流水显示函数
********************************************************************/
void LED_Runing(unsigned char LED_NUM)
{
	switch(LED_NUM)
	{
        case 0:
          LED8 &= ~(1<<0);  //点亮D1灯
          break;
        case 1:
          LED8 &= ~(1<<1);  //点亮D2灯
          break;
        case 2:
          LED8 &= ~(1<<2);  //点亮D3灯
          break;
        case 3:
          LED8 &= ~(1<<3);  //点亮D4灯
          break; 
        case 4:
          LED8 &= ~(1<<4);  //点亮D5灯
          break;
        case 5:
          LED8 &= ~(1<<5);  //点亮D6灯
          break;
        case 6:
          LED8 &= ~(1<<6);  //点亮D7灯
          break;
        case 7:
          LED8 &= ~(1<<7);  //点亮D8灯
          break;				
        default:
          LED8 = 0x00;     //点亮所有的LED灯
          break;
	}
}

//***********************************************************************
//      主程序
//***********************************************************************
void main(void)
{ 
  unsigned char count;
  WDT_Init();
  Clock_Init();                       //时钟初始化
  Port_Init();                          //端口初始化，用于控制IO口输入或输出
  while(1)
  {
    LED8 = 0xFF; 
    LED_Runing(count%8);											//点亮一个LED灯		
    count++;
    delay_ms(200);
  }
}



