/********************************************************************
//DM430-L型开发板RS485通信实验，程序具有收发一体的功能
//RS485之间通过双绞线连接，如果距离近，可以不使用120欧电阻匹配
//将2个DM430-L板子通过导线（双绞线、杜邦线等）连接，连接方式为A-A,B-B
//将该程序分别下载到2个板子中，按任意一个板子的4个按键，都会将键值显示到另外一个板子的LED灯上
//显示LED为二进制形式，比如1，显示的是D1灭，其他的都亮
//发送端按下按键时，8个LED灯会同时灭掉
//也可以将485接口与485转232模块连接通信，通信操作方式一样，按4个按键发送不同的键值
//电脑端发送的话一定要16进制，单字节发送
//波特率更改请通过config.h文件，直接更改baud参数即可，默认是9600
//调试环境：EW430 V5.30
//作者：www.avrgcc.com
//时间：2014.03.01
********************************************************************/

#include <msp430x14x.h>
#include "Config.h"                     //开发板配置头文件，主要配置IO端口信息

uchar key;

//***********************************************************************
//               MSP430IO口初始化
//***********************************************************************
void Port_Init()
{
  LED8DIR  = 0xFF;                      //设置IO口方向为输出
  LED8 = 0xFF;                          //P6口初始设置为FF
  
  P5DIR |= BIT2;                        //P52口为RS485控制口，输出模式
  P5OUT |= BIT2;                        //置高P52
  
  P1SEL = 0x00;                         //P1普通IO功能
  P1DIR = 0xF0;                         //P10~P13输入模式，外部电路已接上拉电阻
}

//**********************************************************************
//	键盘扫描子程序，采用逐键扫描的方式
//**********************************************************************

uchar Key_Scan(void) 
{
  uchar key_check;
  uchar key_checkin;
  key_checkin=KeyPort;          	//读取IO口状态，判断是否有键按下
  key_checkin&= 0x0F;          		//读取IO口状态，判断是否有键按下
  if(key_checkin!=0x0F)            	//IO口值发生变化则表示有键按下
    {
      delay_ms(20);                  	//键盘消抖，延时20MS
      key_checkin=KeyPort;
      if(key_checkin!=0x1F)
        {  
          key_check=KeyPort;
          switch (key_check & 0x0F)
            {
              case 0x0E:key=1;break;
              case 0x0D:key=2;break;
              case 0x0B:key=3;break;
              case 0x07:key=4;break;
            }
          
        }
      
   }
  else
   {
     key=0xFF;        
   }
  return key;
} 

//*************************************************************************
//               MSP430串口初始化
//*************************************************************************
void UART_Init()
{
  U1CTL|=SWRST + CHAR;                //复位SWRST，8位数据模式
  U1TCTL|=SSEL1;                      //SMCLK为串口时钟
  U1BR1=baud_h;                       //BRCLK=8MHZ,Baud=BRCLK/N
  U1BR0=baud_l;                       //N=UBR+(UxMCTL)/8
  U1MCTL=0x00;                        //微调寄存器为0，波特率9600bps
  ME2|=UTXE1;                         //UART1发送使能
  ME2|=URXE1;                         //UART1接收使能
  U1CTL&=~SWRST;
  IE2|=URXIE1;                        //接收中断使能位
  
  P3SEL|= BIT6 + BIT7;                //设置IO口为第二功能模式，启用UART功能
  P3DIR|= BIT6;                       //设置TXD1口方向为输出
}

//*************************************************************************
//              串口1发送数据函数
//*************************************************************************

void Send_Byte(uchar data)
{
  RS485_CTR1;
  while(!(IFG2&UTXIFG1));             //发送寄存器空的时候发送数据
  U1TXBUF=data;
  delay_ms(5);                        //切换之前先有个小延时
  RS485_CTR0;
}

//*************************************************************************
//              串口1发送字符串函数
//*************************************************************************
void Print_Str(uchar *s)
{
  while(*s != '\0')
    {
        Send_Byte(*s++);
        delay_ms(2);
    }
}

//*************************************************************************
//               处理来自串口1的接收中断
//*************************************************************************

#pragma vector=UART1RX_VECTOR
__interrupt void UART1_RX_ISR(void)
{
  uchar data=0;
  
  data=U1RXBUF;                       //接收到的数据存起来
  //Send_Byte(data);                  //将接收到的数据再发送出去
  LED8 = data;
  delay_ms(5);                        //切换之前先有个小延时
  RS485_CTR0;                         //切换到接收状态
}

//*************************************************************************
//           主函数
//*************************************************************************
void main(void)
{ 
  WDT_Init();                         //看门狗设置
  Clock_Init();                       //系统时钟设置
  Port_Init();                        //端口初始化
  UART_Init();                        //串口设置初始化

  RS485_CTR0;                         //切换到接收状态
  _EINT();                            //开中断
  while(1)                            //无限循环
    {
        if(Key_Scan()!=0xFF)
          {
            LED8 = 0xff;
            Send_Byte(key);           //发送字符测试，键值，1,2,3,4
            key = 0xFF;               //清除上一次的键值
          }
    }
}